[
  {
    "scope": "international",
    "system": "fire_alarm",
    "keywords": ["smoke detector", "detector spacing", "nfpa 72", "spacing"],
    "answer_en": "Smoke detector spacing is not a single fixed value; it depends on detector type, ceiling height/geometry, and the applicable standard’s installation rules. Use the relevant section for spacing/placement and document the assumptions.",
    "answer_ar": "تباعد كواشف الدخان مش رقم ثابت؛ بيختلف حسب نوع الكاشف وارتفاع/شكل السقف وقواعد التركيب في المعيار. ارجع لقسم الـ spacing/placement وثبّت الافتراضات في المستندات.",
    "source": "NFPA 72",
    "reference": "Detector Placement (reference)",
    "source_url": ""
  },
  {
    "scope": "saudi",
    "system": "fire_alarm",
    "keywords": ["civil defense", "approval", "saudi", "defense", "اعتماد", "الدفاع المدني"],
    "answer_en": "In Saudi projects, system acceptance typically requires compliance evidence (drawings/submittals), tests, and authority approval procedures before handover. Maintain a complete commissioning file (ITP, test reports, as-builts).",
    "answer_ar": "في مشاريع السعودية، الاستلام عادة يعتمد على إثبات الالتزام (رسومات/سوبميتّال) + الاختبارات + إجراءات اعتماد الجهة قبل التسليم. جهّز ملف تشغيل كامل (ITP، تقارير اختبارات، As-Builts).",
    "source": "Saudi Civil Defense",
    "reference": "Acceptance & Handover (practice)",
    "source_url": ""
  },
  {
    "scope": "egypt",
    "system": "sprinkler",
    "keywords": ["sprinkler", "رشاش", "رشاشات", "water supply", "مدة المياه"],
    "answer_en": "For sprinkler systems, document hazard classification, water supply arrangement, and testing/commissioning requirements. Align with the adopted standard and confirm any local civil defense conditions for submittals and acceptance.",
    "answer_ar": "في الرشاشات لازم توثّق تصنيف الخطورة ومصدر/ترتيب المياه ومتطلبات الاختبار والتشغيل. التزم بالمعيار المعتمد وتأكد من شروط الحماية المدنية المحلية للسوبميتّال والاستلام.",
    "source": "Egypt Civil Defense",
    "reference": "Local acceptance practice",
    "source_url": ""
  }
]
